FreeRTOS/FreeRTOS/Demo/RX600_RX63N-RDK_Renesas/RTOSDemo/Renesas-Files/mcu/rx610/iodefine.h
struct st_dmac3 {
	void          *DMCSA;
	void          *DMCDA;
	unsigned long  DMCBC;
	union {
		unsigned long LONG;
		struct {
			unsigned long :4;
			unsigned long OPSEL:4;
			unsigned long :5;
			unsigned long SZSEL:3;
			unsigned long :1;
			unsigned long SMOD:3;
			unsigned long :1;
			unsigned long DMOD:3;
		} BIT;
	} DMMOD;
	char           wk0[496];
	void          *DMRSA;
	void          *DMRDA;
	unsigned long  DMRBC;
	char           wk1[476];
	union {
		unsigned long LONG;
		struct {
			unsigned long :6;
			unsigned long DSEL:2;
			unsigned long :13;
			unsigned long BRLOD:1;
			unsigned long SRLOD:1;
			unsigned long DRLOD:1;
			unsigned long :2;
			unsigned long DCTG:6;
		} BIT;
	} DMCRA;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DSCLR:1;
		} BIT;
	} DMCRB;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char ECLR:1;
		} BIT;
	} DMCRC;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DREQ:1;
		} BIT;
	} DMCRD;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DEN:1;
		} BIT;
	} DMCRE;
};

struct st_dtc {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char RRS:1;
			unsigned char RCHNE:1;
			unsigned char :2;
			unsigned char ERR:1;
		} BIT;
	} DTCCR;
	char           wk0[3];
	void          *DTCVBR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char SHORT:1;
		} BIT;
	} DTCADMOD;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char DTCST:1;
		} BIT;
	} DTCST;
};

struct st_flash {
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char FLWE:2;
		} BIT;
	} FWEPROR;
	char           wk1[7799160];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :3;
			unsigned char FRDMD:1;
		} BIT;
	} FMODR;
	char           wk2[13];
	union {
		unsigned char BYTE;
		struct {
			unsigned char ROMAE:1;
			unsigned char :2;
			unsigned char CMDLK:1;
			unsigned char DFLAE:1;
			unsigned char :1;
			unsigned char DFLRPE:1;
			unsigned char DFLWPE:1;
		} BIT;
	} FASTAT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char ROMAEIE:1;
			unsigned char :2;
			unsigned char CMDLKIE:1;
			unsigned char DFLAEIE:1;
			unsigned char :1;
			unsigned char DFLRPEIE:1;
			unsigned char DFLWPEIE:1;
		} BIT;
	} FAEINT;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char FRDYIE:1;
		} BIT;
	} FRDYIE;
	char           wk3[45];
	union {
		unsigned short WORD;
		struct {
			unsigned short KEY:8;
			unsigned short :4;
			unsigned short DBRE3:1;
			unsigned short DBRE2:1;
			unsigned short DBRE1:1;
			unsigned short DBRE0:1;
		} BIT;
	} DFLRE;
	char           wk4[14];
	union {
		unsigned short WORD;
		struct {
			unsigned short KEY:8;
			unsigned short :4;
			unsigned short DBWE3:1;
			unsigned short DBWE2:1;
			unsigned short DBWE1:1;
			unsigned short DBWE0:1;
		} BIT;
	} DFLWE;
	char           wk5[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short KEY:8;
			unsigned short :7;
			unsigned short FCRME:1;
		} BIT;
	} FCURAME;
	char           wk6[15194];
	union {
		unsigned char BYTE;
		struct {
			unsigned char FRDY:1;
			unsigned char ILGLERR:1;
			unsigned char ERSERR:1;
			unsigned char PRGERR:1;
			unsigned char SUSRDY:1;
			unsigned char :1;
			unsigned char ERSSPD:1;
			unsigned char PRGSPD:1;
		} BIT;
	} FSTATR0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char FCUERR:1;
			unsigned char :2;
			unsigned char FLOCKST:1;
		} BIT;
	} FSTATR1;
	union {
		unsigned short WORD;
		struct {
			unsigned short FEKEY:8;
			unsigned short FENTRYD:1;
			unsigned short :5;
			unsigned short FENTRY1:1;
			unsigned short FENTRY0:1;
		} BIT;
	} FENTRYR;
	union {
		unsigned short WORD;
		struct {
			unsigned short FPKEY:8;
			unsigned short :7;
			unsigned short FPROTCN:1;
		} BIT;
	} FPROTR;
	union {
		unsigned short WORD;
		struct {
			unsigned short FRKEY:8;
			unsigned short :7;
			unsigned short FRESET:1;
		} BIT;
	} FRESETR;
	char           wk7[2];
	union {
		unsigned short WORD;
		struct {
			unsigned short CMDR:8;
			unsigned short PCMDR:8;
		} BIT;
	} FCMDR;
	char           wk8[12];
	union {
		unsigned short WORD;
		struct {
			unsigned short :15;
			unsigned short ESUSPMD:1;
		} BIT;
	} FCPSR;
	union {
		unsigned short WORD;
		struct {
			unsigned short :3;
			unsigned short BCADR:10;
			unsigned short :2;
			unsigned short BCSIZE:1;
		} BIT;
	} DFLBCCNT;
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short PEERRST:8;
		} BIT;
	} FPESTAT;
	union {
		unsigned short WORD;
		struct {
			unsigned short :15;
			unsigned short BCST:1;
		} BIT;
	} DFLBCSTAT;
	char           wk9[24];
	union {
		unsigned short WORD;
		struct {
			unsigned short :8;
			unsigned short PCKA:8;
		} BIT;
	} PCKAR;
};

struct st_icu {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char IR:1;
		} BIT;
	} IR[255];
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :6;
			unsigned char ISEL:2;
		} BIT;
	} ISELR[255];
	char           wk1[1];
	union {
		unsigned char BYTE;
		struct {
			unsigned char IEN7:1;
			unsigned char IEN6:1;
			unsigned char IEN5:1;
			unsigned char IEN4:1;
			unsigned char IEN3:1;
			unsigned char IEN2:1;
			unsigned char IEN1:1;
			unsigned char IEN0:1;
		} BIT;
	} IER[32];
	char           wk2[224];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :5;
			unsigned char IPR:3;
		} BIT;
	} IPR[144];
	char           wk3[96];
	union {
		unsigned short WORD;
		struct {
			unsigned short FIEN:1;
			unsigned short :7;
			unsigned short FVCT:8;
		} BIT;
	} FIR;
	char           wk4[20238];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char IRQEN:1;
		} BIT;
	} IRQER[16];
	char           wk5[16];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char IRQMD:2;
		} BIT;
	} IRQCR[16];
	char           wk6[16];
	union {
		unsigned short WORD;
		struct {
			unsigned short SSI15:1;
			unsigned short SSI14:1;
			unsigned short SSI13:1;
			unsigned short SSI12:1;
			unsigned short SSI11:1;
			unsigned short SSI10:1;
			unsigned short SSI9:1;
			unsigned short SSI8:1;
			unsigned short SSI7:1;
			unsigned short SSI6:1;
			unsigned short SSI5:1;
			unsigned short SSI4:1;
			unsigned short SSI3:1;
			unsigned short SSI2:1;
			unsigned short SSI1:1;
			unsigned short SSI0:1;
		} BIT;
	} SSIER;
	char           wk7[14];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char NMIEN:1;
		} BIT;
	} NMIER;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :4;
			unsigned char NMIMD:1;
		} BIT;
	} NMICR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char NMIST:1;
		} BIT;
	} NMISR;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :7;
			unsigned char NMICLR:1;
		} BIT;
	} NMICLR;
};

struct st_ioport {
	union {
		unsigned char BYTE;
		struct {
			unsigned char CS7E:1;
			unsigned char CS6E:1;
			unsigned char CS5E:1;
			unsigned char CS4E:1;
			unsigned char CS3E:1;
			unsigned char CS2E:1;
			unsigned char CS1E:1;
			unsigned char CS0E:1;
		} BIT;
	} PFCR0;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CS7S:2;
			unsigned char CS6S:2;
			unsigned char CS5S:2;
			unsigned char CS4S:2;
		} BIT;
	} PFCR1;
	union {
		unsigned char BYTE;
		struct {
			unsigned char CS3S:1;
			unsigned char CS2S:1;
		} BIT;
	} PFCR2;
	union {
		unsigned char BYTE;
		struct {
			unsigned char A23E:1;
			unsigned char A22E:1;
			unsigned char A21E:1;
			unsigned char A20E:1;
			unsigned char A19E:1;
			unsigned char A18E:1;
			unsigned char A17E:1;
			unsigned char A16E:1;
		} BIT;
	} PFCR3;
	union {
		unsigned char BYTE;
		struct {
			unsigned char A15E:1;
			unsigned char A14E:1;
			unsigned char A13E:1;
			unsigned char A12E:1;
			unsigned char A11E:1;
			unsigned char A10E:1;
			unsigned char A9E:1;
			unsigned char A8E:1;
		} BIT;
	} PFCR4;
	union {
		unsigned char BYTE;
		struct {
			unsigned char :1;
			unsigned char WR1BC1E:1;
			unsigned char :1;
			unsigned char DHE:1;
			unsigned char TCLKS:1;
		} BIT;
	} PFCR5;
	union {
		unsigned char BYTE;
		struct {
			unsigned char TPUMS5:1;
			unsigned char TPUMS4:1;
			unsigned char TPUMS3A:1;
			unsigned char TPUMS3B:1;
			unsigned char TPUMS2:1;
			unsigned char TPUMS1:1;
			unsigned char TPUMS0A:1;
			unsigned char TPUMS0B:1;
		} BIT;
	} PFCR6;
	union {
		unsigned char BYTE;
		struct {
			unsigned char TPUMS11:1;
			unsigned char TPUMS10:1;
			unsigned char TPUMS9A:1;
			unsigned char TPUMS9B:1;
			unsigned char TPUMS8:1;
			unsigned char TPUMS7:1;
			unsigned char TPUMS6A:1;
			unsigned char TPUMS6B:1;
		} BIT;
	} PFCR7;
	union {
		unsigned char BYTE;
		struct {
			unsigned char ITS15:1;
			unsigned char ITS14:1;
			unsigned char ITS13:1;
			unsigned char ITS12:1;
			unsigned char ITS11:1;
			unsigned char ITS10:1;
			unsigned char ITS9:1;
			unsigned char ITS8:1;
		} BIT;
	} PFCR8;
	union {
		unsigned char BYTE;
		struct {
			unsigned char ITS7:1;
			unsigned char ITS6:1;
			unsigned char ITS5:1;
			unsigned char ITS4:1;
			unsigned char ITS3:1;
			unsigned char ITS2:1;
			unsigned char ITS1:1;
			unsigned char ITS0:1;
		} BIT;
	} PFCR9;
};

struct st_port0 {
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char B5:1;
			unsigned char B4:1;
			unsigned char B3:1;
			unsigned char B2:1;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} DDR;
	char           wk0[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char B5:1;
			unsigned char B4:1;
			unsigned char B3:1;
			unsigned char B2:1;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} DR;
	char           wk1[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char B5:1;
			unsigned char B4:1;
			unsigned char B3:1;
			unsigned char B2:1;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} PORT;
	char           wk2[31];
	union {
		unsigned char BYTE;
		struct {
			unsigned char :2;
			unsigned char B5:1;
			unsigned char B4:1;
			unsigned char B3:1;
			unsigned char B2:1;
			unsigned char B1:1;
			unsigned char B0:1;
		} BIT;
	} ICR;
};

