FreeRTOS/FreeRTOS/Demo/RX600_RX63N-RDK_Renesas/RTOSDemo/Renesas-Files/mcu/rx610/iodefine.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__ISEL( x )		ICU.ISELR[ ISEL ## x ].BIT.ISEL
#define	 _ISEL( x )		__ISEL( x )
#define	  ISEL( x , y )	_ISEL( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	AD0		(*(volatile struct st_ad     __evenaccess *)0x88040)
#define	AD1		(*(volatile struct st_ad     __evenaccess *)0x88060)
#define	AD2		(*(volatile struct st_ad     __evenaccess *)0x88080)
#define	AD3		(*(volatile struct st_ad     __evenaccess *)0x880A0)
#define	BSC		(*(volatile struct st_bsc    __evenaccess *)0x81300)
#define	CMT		(*(volatile struct st_cmt    __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0   __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0   __evenaccess *)0x88008)
#define	CMT2	(*(volatile struct st_cmt0   __evenaccess *)0x88012)
#define	CMT3	(*(volatile struct st_cmt0   __evenaccess *)0x88018)
#define	CRC		(*(volatile struct st_crc    __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da     __evenaccess *)0x880C0)
#define	DMAC	(*(volatile struct st_dmac   __evenaccess *)0x82502)
#define	DMAC0	(*(volatile struct st_dmac0  __evenaccess *)0x82000)
#define	DMAC1	(*(volatile struct st_dmac1  __evenaccess *)0x82010)
#define	DMAC2	(*(volatile struct st_dmac2  __evenaccess *)0x82020)
#define	DMAC3	(*(volatile struct st_dmac3  __evenaccess *)0x82030)
#define	DTC		(*(volatile struct st_dtc    __evenaccess *)0x87400)
#define	FLASH	(*(volatile struct st_flash  __evenaccess *)0x8C288)
#define	ICU		(*(volatile struct st_icu    __evenaccess *)0x87000)
#define	IOPORT	(*(volatile struct st_ioport __evenaccess *)0x8C100)
#define	PORT0	(*(volatile struct st_port0  __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1  __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2  __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3  __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4  __evenaccess *)0x8C004)
#define	PORT5	(*(volatile struct st_port5  __evenaccess *)0x8C005)
#define	PORT6	(*(volatile struct st_port6  __evenaccess *)0x8C006)
#define	PORT7	(*(volatile struct st_port7  __evenaccess *)0x8C007)
#define	PORT8	(*(volatile struct st_port8  __evenaccess *)0x8C008)
#define	PORT9	(*(volatile struct st_port9  __evenaccess *)0x8C009)
#define	PORTA	(*(volatile struct st_porta  __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb  __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc  __evenaccess *)0x8C00C)
#define	PORTD	(*(volatile struct st_portd  __evenaccess *)0x8C00D)
#define	PORTE	(*(volatile struct st_porte  __evenaccess *)0x8C00E)
#define	PORTF	(*(volatile struct st_portf  __evenaccess *)0x8C00F)
#define	PORTG	(*(volatile struct st_portg  __evenaccess *)0x8C010)
#define	PORTH	(*(volatile struct st_porth  __evenaccess *)0x8C011)
#define	PPG0	(*(volatile struct st_ppg0   __evenaccess *)0x881E6)
#define	PPG1	(*(volatile struct st_ppg1   __evenaccess *)0x881F0)
#define	RIIC0	(*(volatile struct st_riic   __evenaccess *)0x88300)
#define	RIIC1	(*(volatile struct st_riic   __evenaccess *)0x88320)
#define	SCI0	(*(volatile struct st_sci    __evenaccess *)0x88240)
#define	SCI1	(*(volatile struct st_sci    __evenaccess *)0x88248)
#define	SCI2	(*(volatile struct st_sci    __evenaccess *)0x88250)
#define	SCI3	(*(volatile struct st_sci    __evenaccess *)0x88258)
#define	SCI4	(*(volatile struct st_sci    __evenaccess *)0x88260)
#define	SCI5	(*(volatile struct st_sci    __evenaccess *)0x88268)
#define	SCI6	(*(volatile struct st_sci    __evenaccess *)0x88270)
#define	SMCI0	(*(volatile struct st_smci   __evenaccess *)0x88240)
#define	SMCI1	(*(volatile struct st_smci   __evenaccess *)0x88248)
#define	SMCI2	(*(volatile struct st_smci   __evenaccess *)0x88250)
#define	SMCI3	(*(volatile struct st_smci   __evenaccess *)0x88258)
#define	SMCI4	(*(volatile struct st_smci   __evenaccess *)0x88260)
#define	SMCI5	(*(volatile struct st_smci   __evenaccess *)0x88268)
#define	SMCI6	(*(volatile struct st_smci   __evenaccess *)0x88270)
#define	SYSTEM	(*(volatile struct st_system __evenaccess *)0x80000)
#define	TMR0	(*(volatile struct st_tmr0   __evenaccess *)0x88200)
#define	TMR1	(*(volatile struct st_tmr1   __evenaccess *)0x88201)
#define	TMR2	(*(volatile struct st_tmr0   __evenaccess *)0x88210)
#define	TMR3	(*(volatile struct st_tmr1   __evenaccess *)0x88211)
#define	TMR01	(*(volatile struct st_tmr01  __evenaccess *)0x88204)
#define	TMR23	(*(volatile struct st_tmr01  __evenaccess *)0x88214)
#define	TPU0	(*(volatile struct st_tpu0   __evenaccess *)0x88110)
#define	TPU1	(*(volatile struct st_tpu1   __evenaccess *)0x88120)
#define	TPU2	(*(volatile struct st_tpu1   __evenaccess *)0x88130)
#define	TPU3	(*(volatile struct st_tpu0   __evenaccess *)0x88140)
#define	TPU4	(*(volatile struct st_tpu1   __evenaccess *)0x88150)
#define	TPU5	(*(volatile struct st_tpu1   __evenaccess *)0x88160)
#define	TPU6	(*(volatile struct st_tpu0   __evenaccess *)0x88180)
#define	TPU7	(*(volatile struct st_tpu1   __evenaccess *)0x88190)
#define	TPU8	(*(volatile struct st_tpu1   __evenaccess *)0x881A0)
#define	TPU9	(*(volatile struct st_tpu0   __evenaccess *)0x881B0)
#define	TPU10	(*(volatile struct st_tpu1   __evenaccess *)0x881C0)
#define	TPU11	(*(volatile struct st_tpu1   __evenaccess *)0x881D0)
#define	TPUA	(*(volatile struct st_tpua   __evenaccess *)0x88100)
#define	TPUB	(*(volatile struct st_tpua   __evenaccess *)0x88170)
#define	WDT		(*(volatile union un_wdt     __evenaccess *)0x88028)
#pragma bit_order
#pragma packoption
#endif